tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
brew "awscli"
brew "bat"
brew "cask"
brew "chezmoi"
brew "gh"
brew "git"
brew "jq"
brew "lsd"
brew "make"
brew "mas"
brew "neofetch"
brew "nvm"
brew "pyenv"
brew "ruby"
brew "rust"
brew "starship"
brew "trash"
brew "tree"
brew "uv"
brew "vim"
brew "zsh-autosuggestions"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "arc"
cask "cursor"
cask "brave-browser"
cask "bartender"
cask "dbeaverlite"
cask "docker"
cask "firefox"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "hammerspoon"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "logi-options+"
cask "maccy"
cask "meetingbar"
cask "notion"
cask "postman"
cask "raycast"
cask "spotify"
cask "vagrant"
cask "visual-studio-code"
cask "zoom"

{{ if eq .chezmoi.hostname "treehopper" }}
cask "steam"
brew "handbrake"
{{ end }}