tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
brew "awscli"
brew "bat"
brew "cask"
brew "chezmoi"
brew "gh"
brew "git"
brew "handbrake"
brew "jq"
brew "lsd"
brew "make"
brew "mas"
brew "neofetch"
brew "nvm"
brew "postgresql@15"
brew "pyenv"
brew "ruby"
brew "rust"
brew "starship"
brew "trash"
brew "tree"
brew "uv"
brew "vim"
brew "zsh-autosuggestions"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "1password"
cask "ableton-live-suite@11"
cask "alfred"
cask "amethyst"
cask "arc"
cask "bartender"
cask "brave-browser"
cask "cursor"
cask "dbeaverlite"
cask "docker"
cask "firefox"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "hammerspoon"
cask "handbrake"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "logi-options+"
cask "maccy"
cask "meetingbar"
cask "notion"
cask "raycast"
cask "remarkable"
cask "spotify"
cask "steam"
cask "vagrant"
cask "visual-studio-code"
cask "vnc-viewer"
cask "zoom"
mas "MacDroid", id: 1476545828
mas "Steam Link", id: 1246969117
vscode "1yib.rust-bundle"
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "batisteo.vscode-django"
vscode "bmalehorn.shell-syntax"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "cstrap.python-snippets"
vscode "deerawan.vscode-dash"
vscode "demystifying-javascript.python-extensions-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "fill-labs.dependi"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hbenl.vscode-test-explorer"
vscode "kaih2o.python-resource-monitor"
vscode "kdl-org.kdl"
vscode "kevinrose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mhutchie.git-graph"
vscode "mintlify.document"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "planbcoding.vscode-react-refactor"
vscode "rust-lang.rust-analyzer"
vscode "sourcery.sourcery"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "thebarkman.vscode-djaneiro"
vscode "timonwong.shellcheck"
vscode "trabpukcip.wolf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscodevim.vim"
vscode "xirider.livecode"
vscode "ziyasal.vscode-open-in-github"
